// *++
//
// Copyright (c) 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   ScriptCmdStrings.uni
// 
// Abstract:
// 
//   String definitions for commands only used in scripts
// 
// Revision History:
// 
// --*/ 

/=#

#langdef   eng "English"

#string STR_SHELLENV_FOR_INCORRECT_SYNTAX #language eng  "%hs: Incorrect syntax(line %d)\n"

#string STR_SHELLENV_ENDFOR_ONLY_SUPPORTED_SCRIPT #language eng  "%Hendfor%N: Only supported in script files\n"

#string STR_SHELLENV_SCRIPT_TOO_MANY_ARGUMENTS #language eng  "%hs: Too many arguments(line %d)\n"

#string STR_SHELLENV_ENDFOR_TOO_MANY_ARGUMENTS #language eng  "%Hendfor%N: Too many arguments(line %d)\n"

#string STR_SHELLENV_ENDFOR_NO_CORRESPDING_FOR #language eng  "%Hendfor%N: No corresponding FOR statement(line %d)\n"

#string STR_SHELLENV_ENDFOR_NO_FOR_STATEMENT #language eng  "%Hendfor%N: No corresponding FOR statement(line %d)\n"

#string STR_SHELLENV_GOTO_ONLY_SUPPORTED_SCRIPT #language eng  "%Hgoto%N: Only supported in script files\n"

#string STR_SHELLENV_GOTO_TOO_MANY_ARGS #language eng  "%Hgoto%N: Too many arguments(line %d)\n"

#string STR_SHELLENV_GOTO_TOO_FEW_ARGS #language eng  "%Hgoto%N: Too few arguments(line %d)\n"

#string STR_SHELLENV_GOTO_OUT_OF_RESOURCES #language eng  "%Hgoto%N: Out of Resources\n"

#string STR_SHELLENV_GOTO_CANNOT_EXECUTE_SCRIPT #language eng  "%Hgoto%N: Cannot execute script - %r\n"

#string STR_SHELLENV_GOTO_TARGET_LABEL #language eng  "%Hgoto%N: Target label \":%s\" not found(line %d)\n"

#string STR_SHELLENV_IF_ONLY_SUPPORTED_SCRIPT #language eng  "%Hif%N: Only supported in script files\n"

#string STR_SHELLENV_IF_TOO_FEW_ARGS   #language eng  "%Hif%N: Too few arguments(line %d)\n"

#string STR_SHELLENV_IF_INCORRECT_SYNTAX #language eng  "%Hif%N: Incorrect syntax(line %d)\n"

#string STR_SHELLENV_IF_CHECK_FILE_EXISTENCE #language eng  "%Hif%N: Check file existence fail - %r(line %d)\n"

#string STR_SHELLENV_IF_CANNOT_EXECUTE_SCRIPT #language eng  "%Hif%N: Cannot execute script - %r\n"

#string STR_SHELLENV_IF_ENDIF_ONLY_SUPPORTED_SCRIPT #language eng  "%Hendif%N: Only supported in script files\n"

#string STR_SHELLENV_IF_ENDIF_TOO_MANY_ARGS #language eng  "%Hendif%N: Too many arguments(line %d)\n"

#string STR_SHELLENV_IF_ENDIF_NO_CORRESPONDING #language eng  "%Hendif%N: No corresponding IF statement(line %d)\n"

#string STR_SHELLENV_IF_ENDIF_CANNOT_EXECUTE_SCRIPT #language eng  "%Hendif%N: Cannot execute script - %r\n"

#string STR_SHELLENV_IF_ELSE_ONLY_SUPPORTED_SCRIPT #language eng  "%Helse%N: Only supported in script files\n"

#string STR_SHELLENV_IF_ELSE_TOO_MANY_ARGS #language eng  "%Helse%N: Too many arguments(line %d)\n"

#string STR_SHELLENV_IF_ELSE_NO_CORRESPONDING_IF #language eng  "%Helse%N: No corresponding IF statement(line %d)\n"

#string STR_SHELLENV_IF_ELSE_ONLY_ONE_ELSE #language eng  "%Helse%N: Only 1 ELSE is allowed in a IF statement(line %d)\n"

#string STR_SHELLENV_IF_ELSE_CANNOT_EXECUTE #language eng  "%Helse%N: Cann't execute script - %r\n"

#string STR_SHELLENV_PAUSE_ONLY_SUPPORTED_SCRIPT #language eng  "%Hpause%N: Only supported in script files\n"

#string STR_SHELLENV_PAUSE_TOO_MANY_ARGUMENTS #language eng "%hs: Too many arguments (line %d)\n" 

#string STR_SHELLENV_SCRIPT_TOO_MANY_ARGUMENTS #language eng "%hs: Too many arguments (line %d)\n" 

#string STR_SHELLENV_PAUSE_WRITING_PROMPT_ERROR #language eng  "%Hpause%N: Writing prompt error\n"

#string STR_SHELLENV_PAUSE_READING_KEYSTROKE #language eng  "%Hpause%N: Reading keystroke error\n"

